; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared2 - mode
	thermograph1 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star7 - direction
	Star8 - direction
	Star10 - direction
	GroundStation11 - direction
	GroundStation6 - direction
	GroundStation9 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
)
(:goal (and
	(pointing satellite0 Planet19)
	(have_image Phenomenon12 infrared0)
	(have_image Phenomenon13 infrared0)
	(have_image Star14 thermograph1)
	(have_image Planet15 thermograph1)
	(have_image Planet16 infrared0)
	(have_image Planet17 thermograph1)
	(have_image Star18 thermograph1)
	(have_image Planet19 infrared2)
))

)

; plan
1. (turn_to satellite0 groundstation6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 planet17 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet17)
   goals met: 0 of 9
5. (take_image satellite0 planet17 instrument0 thermograph1)
   added: (have_image planet17 thermograph1)
   goals met: 1 of 9
6. (turn_to satellite0 planet16 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet16)
   goals met: 1 of 9
7. (take_image satellite0 planet16 instrument0 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 2 of 9
8. (turn_to satellite0 planet15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet15)
   goals met: 2 of 9
9. (take_image satellite0 planet15 instrument0 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon13 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon13 instrument0 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 4 of 9
12. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 9
13. (take_image satellite0 phenomenon12 instrument0 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 5 of 9
14. (turn_to satellite0 star14 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star14)
   goals met: 5 of 9
15. (take_image satellite0 star14 instrument0 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 6 of 9
16. (turn_to satellite0 star18 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star18)
   goals met: 6 of 9
17. (take_image satellite0 star18 instrument0 thermograph1)
   added: (have_image star18 thermograph1)
   goals met: 7 of 9
18. (turn_to satellite0 planet19 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 planet19)
   goals met: 8 of 9
19. (take_image satellite0 planet19 instrument0 infrared2)
   added: (have_image planet19 infrared2)
   goals met: 9 of 9
